//
//  ViewController.swift
//  DNS_test
//
//  Created by mac on 27.05.2024.
//

import UIKit

class LibraryVC: UIViewController {

    override func viewDidLoad() {
        super.viewDidLoad()
        // Do any additional setup after loading the view.
    }


}

/*
 Приложение должно состоять из 2 экранов:
 1. Основной экран:
 a. отображение списка книг – в ячейке должно отображаться наименование книги, автор, год издания;
 b. редактирование списка – добавление, редактирование, удаление;
 c. сортировка - по наименованию, по автору, по году;
 d. поиск книг – поиск должен происходить по наименованию книги, автору, году издания;
 2. Экран добавление/редактирование книги
  
 Для разработки использовать Swift, UIKit.
 Архитектуру приложения использовать на свой выбор, но придерживаться принципов SOLID.
 Верстку приложения осуществлять только кодом.
 Не использовать сторонние фреймворки.
 При работе с коллекцией использовать DiffableDataSource
  
 Сущность книга: Наименование, автор, год издания.
 Хранение списка организовать в CoreData.
 */
